# LAB 2: Exploring Pandas

# Q1.

First, I install the pandas library

In [1]:
%pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import numpy as np
import pandas as pd

Pandas helps read and manipulate data files

## Series
Series is a single column list

## Dataframe
Dataframe is a 2D table. This will be used more for adding and deleting rows and columns. Dataframe is a collection of series

In [3]:
s1 = pd.Series([1,2,4,-3]) # if I give differnt data types, then it will be assigned Object datatype
s1

0    1
1    2
2    4
3   -3
dtype: int64

In [4]:
s1[3]

np.int64(-3)

In [5]:
s1[3] = -7
s1

0    1
1    2
2    4
3   -7
dtype: int64

In [6]:
s1.values # returns nd array, it's an attribute

array([ 1,  2,  4, -7])

In [7]:
s1.index # returns range object

RangeIndex(start=0, stop=4, step=1)

In [8]:
# defining series with custom indices

In [9]:
s2 = pd.Series([4,7,5,0], index=['a', 'b', 'c', 'd'])
s2

a    4
b    7
c    5
d    0
dtype: int64

In [10]:
s2['a']

np.int64(4)

In [11]:
s2[['a', 'd']] # can't use colons here, use commas

a    4
d    0
dtype: int64

In [12]:
# boolean filtering
s2[s2>0]

a    4
b    7
c    5
dtype: int64

In [13]:
s1 * 2

0     2
1     4
2     8
3   -14
dtype: int64

In [14]:
np.sqrt(s2[s2>0]) # numpy accepts both series and dataframe

a    2.000000
b    2.645751
c    2.236068
dtype: float64

In [15]:
sdata = {'Ohio': 3240, 'Texas': 4320, 'Oregon': 6790, 'Utah': 8907}
s3 = pd.Series(sdata) # treats keys as indices and values as, well, values :)
s3

Ohio      3240
Texas     4320
Oregon    6790
Utah      8907
dtype: int64

In [16]:
l1 = ['Ohio','Texas','Oregon', 'Utah']
l2 = [3240, 4320, 6790, 8907]
s4 = pd.Series(l2, index=l1) # if I don't give index, then default index will be assigned
s4

Ohio      3240
Texas     4320
Oregon    6790
Utah      8907
dtype: int64

Index is itself also created as object

In [17]:
s4.name = 'Population'
s4.index.name  = 'State'
s4

State
Ohio      3240
Texas     4320
Oregon    6790
Utah      8907
Name: Population, dtype: int64

In [18]:
data = { 'state': ['Ohio', 'Ohio', 'Nevada', 'Utah'],
         'year': [2004,2001,2004,2005],
         'pop': [1.5, 1.7, 1.6, 1.1]} # DF of 3 columns
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2004  1.5
1    Ohio  2001  1.7
2  Nevada  2004  1.6
3    Utah  2005  1.1

In [ ]:
df2 = pd.DataFrame(df1, columns = ['year', 'state', 'pop']) # Changing names of columns
df2.melt

   year   state  pop
0  2004    Ohio  1.5
1  2001    Ohio  1.7
2  2004  Nevada  1.6
3  2005    Utah  1.1

In [20]:
df3 = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])
df3

    state  year  pop
a    Ohio  2004  1.5
b    Ohio  2001  1.7
c  Nevada  2004  1.6
d    Utah  2005  1.1

While indexing, we can extract columns as series or sub-dataframe.

In [21]:

df3.year # series

a    2004
b    2001
c    2004
d    2005
Name: year, dtype: int64

In [22]:
df3['year'] # series

a    2004
b    2001
c    2004
d    2005
Name: year, dtype: int64

In [23]:
df4 = df3[['year']] # retrieves columns as Dataframe using double square brackets
df4

   year
a  2004
b  2001
c  2004
d  2005

Now, we extract rows using loc(for non-numeric indices) and iloc(for numeric indices)

In [24]:
df3.loc['d'] # converts as series but can extract only one row

state    Utah
year     2005
pop       1.1
Name: d, dtype: object

In [25]:
df3.year.loc['d'] # extracts single value, first accessing column then year

np.int64(2005)

In [26]:
df3.loc['d'].year # first accessing row then column

np.int64(2005)

In [27]:
df3.iloc[2] # all non-numeric indices are also hashed to numeric values

state    Nevada
year       2004
pop         1.6
Name: c, dtype: object

In [28]:
# df3.loc[2] # won't work
df1.loc[2]

state    Nevada
year       2004
pop         1.6
Name: 2, dtype: object

In [29]:
df3['debt'] = 0 # Adds or modifies all the values of column

In [30]:
df3

    state  year  pop  debt
a    Ohio  2004  1.5     0
b    Ohio  2001  1.7     0
c  Nevada  2004  1.6     0
d    Utah  2005  1.1     0

In [31]:
df3['debt_new'] = [90,56,78,34]
df3

    state  year  pop  debt  debt_new
a    Ohio  2004  1.5     0        90
b    Ohio  2001  1.7     0        56
c  Nevada  2004  1.6     0        78
d    Utah  2005  1.1     0        34

Axis 0 is top to bottom<br/>
Axis 1 is left to right

In [32]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [33]:
val = obj.drop('e') # does not alter/modify original series/dataframe
# deletes entire row by default while seraching vertically for index name, 
# if axis=1 then delets column while seraching in the headers of column
val # New modified table is returned

a    0
b    1
c    2
d    3
dtype: int64

In [34]:
obj # not modified

a    0
b    1
c    2
d    3
e    4
dtype: int64

# Indexing

In [35]:
obj[0] # can access directly using numeric values witgout iloc in Series only, will depreciate

/var/folders/_8/stmfqx710clbn04z1vg4j8lr0000gn/T/ipykernel_8504/2131736506.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[0] # can access directly using numeric values witgout iloc in Series only, will depreciate

np.int64(0)

In [36]:
obj['a']

np.int64(0)

In [37]:
obj['b':'c'] # inclusive when we use numeric values in both Series and Dataframe

b    1
c    2
dtype: int64

In [38]:
obj[0:2] # not-inclusive of 2 in both Series and Dataframe

a    0
b    1
dtype: int64

# Arithmetic Operations
Aligns operations  on indices

In [39]:
s1 = pd.Series([7,7,7,7], index=['a','b','c','d'])
s2 = pd.Series([-2,3,4,1], index=['b','c','d','e'])
s1+s2 # or s1.add(s2)

a     NaN
b     5.0
c    10.0
d    11.0
e     NaN
dtype: float64

In [40]:
s1.add(s2, fill_value=0)

a     7.0
b     5.0
c    10.0
d    11.0
e     1.0
dtype: float64

In [41]:
np.nan # NaN data_type

nan

In [42]:
df = pd.DataFrame(np.arange(16).reshape((4,4)), columns=['one', 'two', 'three', 'four'], index=['Ohio','Nevada','Utah','Utah']) 
# index can be same here
df

        one  two  three  four
Ohio      0    1      2     3
Nevada    4    5      6     7
Utah      8    9     10    11
Utah     12   13     14    15

Original array remains same even after sorting

In [43]:
# rank() ranks indices based on order of values
s1 = pd.Series([-2,3,4,1], index=['a','b','c','d'])
s1.rank() # if two values are the same then we can use a tie-breaking rule here

a    1.0
b    3.0
c    4.0
d    2.0
dtype: float64

In [44]:
s1.rank(method='first') # what appears first is assigned first

a    1.0
b    3.0
c    4.0
d    2.0
dtype: float64

In [45]:
s1.rank() # default; assigns values as per average

a    1.0
b    3.0
c    4.0
d    2.0
dtype: float64

In DF, sorting takes place in terms of names of column and row headers<br/>
Using 'by' argument, we can use a different row/col for sorting.
skipna argument to skip NaN numbers. If we don't then because of any NaN value in column, the entire operation results in NaN
percentile means if 50% is 0.35 then 50% of the values are 0.35 or less than 0.35.

# Q2.

In [58]:
data = {'Location':['United States', 'India', 'Brazil', 'Russia', 'United Kingdom', 'France', 'Spain', 'Italy', 'Turkey', 'Germany'],
        'Cases': [28_833_039, 11_079_979, 10_517_232, 4_246_079, 4_170_519, 3_736_016, 3_188_553, 2_907_825, 2_693_164, 2_444_169],
        'Deaths': [517_204, 156_938, 254_263, 86_122, 122_705, 86_332,69_142,97_507,28_503,70_601],
        'Recovered':[np.nan,10_763_451,9_386_440,3_811_797,np.nan,np.nan,np.nan,2_398_352,2_565_723,2_242_767]}
df = pd.DataFrame(data)
df

         Location     Cases  Deaths   Recovered
0   United States  28833039  517204         NaN
1           India  11079979  156938  10763451.0
2          Brazil  10517232  254263   9386440.0
3          Russia   4246079   86122   3811797.0
4  United Kingdom   4170519  122705         NaN
5          France   3736016   86332         NaN
6           Spain   3188553   69142         NaN
7           Italy   2907825   97507   2398352.0
8          Turkey   2693164   28503   2565723.0
9         Germany   2444169   70601   2242767.0

# Q3.

In [59]:
df['Status'] = df['Cases']
df

         Location     Cases  Deaths   Recovered    Status
0   United States  28833039  517204         NaN  28833039
1           India  11079979  156938  10763451.0  11079979
2          Brazil  10517232  254263   9386440.0  10517232
3          Russia   4246079   86122   3811797.0   4246079
4  United Kingdom   4170519  122705         NaN   4170519
5          France   3736016   86332         NaN   3736016
6           Spain   3188553   69142         NaN   3188553
7           Italy   2907825   97507   2398352.0   2907825
8          Turkey   2693164   28503   2565723.0   2693164
9         Germany   2444169   70601   2242767.0   2444169

In [60]:
df['Status'] = df['Cases'] < 3_000_000
df

         Location     Cases  Deaths   Recovered  Status
0   United States  28833039  517204         NaN   False
1           India  11079979  156938  10763451.0   False
2          Brazil  10517232  254263   9386440.0   False
3          Russia   4246079   86122   3811797.0   False
4  United Kingdom   4170519  122705         NaN   False
5          France   3736016   86332         NaN   False
6           Spain   3188553   69142         NaN   False
7           Italy   2907825   97507   2398352.0    True
8          Turkey   2693164   28503   2565723.0    True
9         Germany   2444169   70601   2242767.0    True

In [61]:
df.dropna(subset=['Recovered'])

  Location     Cases  Deaths   Recovered  Status
1    India  11079979  156938  10763451.0   False
2   Brazil  10517232  254263   9386440.0   False
3   Russia   4246079   86122   3811797.0   False
7    Italy   2907825   97507   2398352.0    True
8   Turkey   2693164   28503   2565723.0    True
9  Germany   2444169   70601   2242767.0    True